<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"71501174fa43d17e50b7ce4c28079d7d67b0828c08128ae8def3593a891234be","plan_job_ref":"Job Staging Image Build & Push #7 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7323668216","plan_hash":"95d5c67960feb98c40f77b9a70d140e9b8ab81084ac34672e3cfc51a0846eadd","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecs_cluster.fastapi-cluster will be created
+   resource "aws_ecs_cluster" "fastapi-cluster" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       name     = "fastapi-cluster"
+       tags_all = (known after apply)

+       setting {
+           name  = "containerInsights"
+           value = "enabled"
        }
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = (known after apply)
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = (known after apply)
+           subnets          = (sensitive value)
        }
    }

  # aws_ecs_task_definition.service will be created
+   resource "aws_ecs_task_definition" "service" {
+       arn                   = (known after apply)
+       arn_without_revision  = (known after apply)
+       container_definitions = jsonencode(
            [
+               {
+                   cpu          = 10
+                   essential    = true
+                   image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:latest"
+                   memory       = 1000
+                   name         = "fastapi"
+                   portMappings = [
+                       {
+                           containerPort = 5000
+                           hostPort      = 5000
                        },
                    ]
                },
            ]
        )
+       family                = "fastapi-docker-image"
+       id                    = (known after apply)
+       network_mode          = (known after apply)
+       revision              = (known after apply)
+       skip_destroy          = false
+       tags_all              = (known after apply)
    }

  # aws_security_group.allow_port_5000 will be created
+   resource "aws_security_group" "allow_port_5000" {
+       arn                    = (known after apply)
+       description            = "Mapping port 5000 to container port"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "0.0.0.0/0",
                ]
+               description      = ""
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
            },
        ]
+       id                     = (known after apply)
+       ingress                = (sensitive value)
+       name                   = "open_port_5000"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags_all               = (known after apply)
+       vpc_id                 = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #7](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7323668216)